{
  "Personal Information": {
    "Name": "Yurii Cherkasov",
    "Birthdate": "21.05.1982",
    "E-mail": "yurii.cherkasov@protonmail.com",
    "Phone": [
      "+1 (256) 8503463",
      "+84 (83) 9052141",
      "+380 (68) 5655707"
    ],
    "Current location": "Thành phố Hồ Chí Minh, Việt Nam (UTC+7)"
  },
  "Social": {
    "LinkedIn": "https://www.linkedin.com/in/yuchdev/",
    "GitHub": "https://github.com/yuchdev",
    "Facebook": "https://www.facebook.com/yuchdev",
    "Twitter": "https://twitter.com/yuchdev",
    "Instagram": "https://www.instagram.com/yuchdev"
  },
  "Overview": "Tôi là một kỹ sư phần mềm tận tâm, có hơn một thập kỷ kinh nghiệm trong thiết kế và phát triển phần mềm, với niềm đam mê để tạo ra các chương trình và sản phẩm tốt. Chuyên môn của tôi là C++, cùng với Java/Python là các ngôn ngữ phụ, hoặc riêng biệt hoặc kết hợp với nhau. Tôi hỗ trợ các hệ thống cũ, triển khai các hệ thống mới và thiết kế chúng từ đầu. Tôi có kinh nghiệm cả trong doanh nghiệp lớn và trong các startup, thiết lập quy trình và luồng làm việc phát triển, Agile/Scrum, xem xét mã nguồn, tích hợp liên tục và theo dõi nhiệm vụ, cũng như cung cấp lãnh đạo kỹ thuật cho một nhóm nhỏ của các kỹ sư phần mềm, DevOps và QA. Bạn có thể xem các dự án của tôi trên Github, bao gồm nhưng không giới hạn đến các dự án phần mềm sau",
  "Projects": {
    "Advanced C++ by Example": "Tôi tạo ra tài liệu giáo dục cho khóa học C++ Nâng cao",
    "Comprehensive C++ Books Catalog": "Tôi là người tạo và duy trì Sách Catalog toàn diện về C++ nhất",
    "Probabilistic Calculator": "Máy tính xác suất, kiểm tra xem tệp dữ liệu nhị phân khác có được mã hóa hay không",
    "MD5 Bruteforcer": "Phá mật khẩu đa luồng đơn giản MD5 bruteforcer cho băm MD5 (chỉ với mục đích giáo dục!)",
    "Code Generator": "Trình tạo mã chương trình và báo cáo hỗ trợ C++, Java, HTML5 và Markdown. CV này đã được tạo ra với sự trợ giúp của trình tạo mã chính xác này"
  },
  "Professional skills": {
    "Strong experience in С/C++ (incl. C++14/17, STL, Templates)": [
      "Boost (thư viện mục đích chung, Networking, Metaprogramming)",
      "Qt5, QtLinguist, Qt Installer Framework",
      "Phát triển đa nền tảng, mà tôi coi là tài sản có giá trị của mình",
      "Đồng thời, kỹ thuật lock-based và lock-free, IPC, tính phân tán",
      "Kỹ năng chuyên nghiệp"
    ],
    "Kinh nghiệm nhỏ hơn nhưng vẫn tốt trong Python": [
      "Django REST Framework",
      "PyQt5, PyQML, phát triển ứng dụng máy tính để bàn với Python",
      "Tự động hóa đường ống CI/CD",
      "Nói chung, tôi có thể tự động hóa gần như mọi thứ với Python, và thích làm điều đó"
    ],
    "Kinh nghiệm làm việc trong Java": [
      "Core Java và JavaFX để phát triển ứng dụng máy tính để bàn đa nền tảng",
      "Nền tảng kiểm tra đen cao tải cho REST API"
    ],
    "Phát triển Unix": [
      "Công cụ truyền thống của Unix: Scripting (bash), Xây dựng (gcc, Makefiles), Debugging (gdb)",
      "Công cụ Unix hiện đại: Profiling (perf, Valgrind), Containerization (Docker), ảo hóa (KVM, Xen)",
      "POSIX, pthreads, các kỹ thuật hiệu suất cao như CPU affinity hoặc kernel bypassing",
      "Kinh nghiệm phát triển cho Linux, gia đình BSD và các hệ thống Unix độc quyền"
    ],
    "Windows development": [
      "API Windows, đa luồng, dịch vụ, COM và RPC",
      "Phát triển cấp thấp, bảo vệ khai thác, khóa hệ thống",
      "Sử dụng WinDbg và phân tích sự cố khởi động lại"
    ],
    "Phát triển cơ sở dữ liệu": [
      "Sử dụng truy vấn SQL, thủ tục được lưu trữ, kích hoạt, xem và chỉ mục",
      "Có kinh nghiệm làm việc với các cơ sở dữ liệu quan hệ lớn: MS SQL, Oracle 11g, Postgres",
      "Sử dụng NoSQL (MongoDB, Redis) trong nhiều dự án, từ thiết kế đến tối ưu hóa",
      "Sử dụng cơ sở dữ liệu nhúng thường xuyên: SQLite, UnQLite"
    ],
    "Kỹ năng DevOps": [
      "Liên tục tích hợp và phân phối: TeamCity, GitLab CI, GitHub Actions",
      "Git(Hub): Quản lý phiên bản, quản lý nhánh và phát hành",
      "Docker, Ansible và tự động hóa luồng làm việc chung trên Linux",
      "AWS, các công cụ triển khai và quản lý, AWS CLI và Boto3 API",
      "Công nghệ máy chủ MS: Active Directory và LDAP, Hyper-V Server, Docker cho Windows"
    ],
    "Kỹ năng chung": [
      "Công cụ chung cho quản lý phiên bản, theo dõi vấn đề và tài liệu: Git, Jira, Confluence, Doxygen",
      "Phân tích và thiết kế hướng đối tượng hiện đại",
      "Thư viện XML/XSL/XSD và truy vấn XPath"
    ]
  },
  "Employment history": {
    "VEKTOR T13 Technologies": {
      "Name": "Công ty TNHH Công nghệ Vektor T13",
      "Brief": "Công ty khởi nghiệp An ninh IT",
      "Website": "https://www.vektort13.pro/",
      "Period": "12.2019 - 04.2022",
      "Position": "Nhà phát triển C++ chính",
      "Description": "Chúng tôi là một công ty khởi nghiệp nhỏ, cố gắng tạo ra một dòng sản phẩm liên quan đến quyền riêng tư, bao gồm bảo vệ chống lại việc chụp vân tay, giám sát và theo dõi, và có kế hoạch cung cấp dịch vụ VPN khó khăn hơn.",
      "Projects": {
        "Virtualbox": "Sản phẩm ảo hóa x86/AMD64/Intel64 mạnh mẽ được phát triển mở. Tôi đã tạo ra nhánh riêng của mình với những cải tiến nhỏ hơn so với phiên bản của Oracle, thực hiện một bộ công cụ biên dịch đa nền tảng và làm việc trên tài liệu.",
        "Kiểm tra IP": "Hệ thống chống gian lận cho một cuộc kiểm tra toàn diện về địa chỉ IP, cung cấp báo cáo về vị trí địa lý, chi tiết kết nối và các mối đe dọa có thể có với địa chỉ IP đó. Tôi đã làm việc trên phía máy chủ, phát triển một Trình tổng hợp API Chống gian lận để thu thập thông tin về địa chỉ IP được yêu cầu từ một số API bên thứ ba"
      },
      "Programming languages, products and technologies": "C, C++, Qt5, Python, PyQt, Django REST Framework, CMake, TeamCity"
    },
    "Massive": {
      "Name": "Massive, LLC",
      "Brief": "Nhà cung cấp dịch vụ tính toán phân tán",
      "Website": "https://www.joinmassive.com/",
      "Period": "09.2019 - 12.2019",
      "Position": "Kỹ sư phần mềm cấp cao",
      "Description": "Làm việc trên SDK đa nền tảng Windows/macOS cho nền tảng kiếm tiền ứng dụng thay thế, cho phép nhà phát triển có nhiều sự tự do hơn trong việc kiếm tiền từ các ứng dụng miễn phí của mình, thay vì chỉ thêm quảng cáo khó chịu.",
      "Projects": {
        "Continuous Integration": "Tôi đã có những cải tiến đáng kể trong quá trình phát triển và pipeline liên tục tích hợp, tạo ra hệ thống thống nhất cho việc xây dựng, ký và đóng gói ứng dụng.",
        "CPU Workload": "Thiết kế và triển khai một hệ thống giữ tải CPU được giới hạn ở một giá trị nhất định để đảm bảo trải nghiệm người dùng thoải mái."
      },
      "Programming languages, products and technologies": "C++, Python, JavaScript, CMake, AWS API, Google Test"
    },
    "Web Gears": {
      "Name": "WebGear Services, LTD (Thương hiệu CyberYozh)",
      "Brief": "Startup bảo vệ quyền riêng tư trên Internet",
      "Website": "https://cyberyozh.com/",
      "Period": "10.2014 - 07.2018",
      "Position": "Nhà tư vấn, Lập trình viên C++ chính",
      "Description": "Từ đây, tôi đã chuyển từ các công ty lớn sang các startup nhỏ. Với kinh nghiệm trong doanh nghiệp của mình, tôi định nghĩa hầu hết mọi thứ từ kiến ​​trúc đến quy trình từ đầu, bao gồm liên tục tích hợp và kiểm tra chất lượng, nhưng vẫn chủ yếu là kỹ thuật, không phải là vị trí quản lý.",
      "Projects": {
        "VPN client": "Phần mềm VPN với bảo vệ dữ liệu thông qua chống rò rỉ dữ liệu",
        "PanicButton": "PanicButton là hệ thống xóa dữ liệu khẩn cấp, phá hủy tất cả các dữ liệu nhạy cảm mà không thể khôi phục được trong trường hợp tình huống khẩn cấp, chẳng hạn như bị đánh cắp máy tính xách tay chứa thông tin nhạy cảm."
      },
      "Programming languages, products and technologies": "C++, Boost, Qt5, Python, Windows RAS API, REST API, CMake, TeamCity"
    },
    "Deutsche Bank": {
      "Name": "Ngân hàng Deutsche",
      "Brief": "Ngân hàng Đầu tư Toàn cầu",
      "Website": "https://db.com/",
      "Period": "11.2012 - 09.2014",
      "Position": "Kỹ sư phần mềm cấp cao",
      "Description": "",
      "Projects": {
        "RAPID": "Có lẽ đó là dự án kỹ thuật khó nhất trong sự nghiệp của tôi trong các công ty lớn cho đến nay. Đó là một nền tảng giao dịch thời gian thực, và tôi cải thiện hiệu suất của hệ thống truyền tin yêu cầu thấp độ trễ (<20 mcs cho chu kỳ giao dịch). Cuối cùng, tôi đã sử dụng các thuật toán không khóa không phải là một câu đố lập trình, mà là mã sản xuất.",
        "RMS": "Một hệ thống quản lý rủi ro quan trọng với kiến trúc đa tầng, nơi tôi đã tiếp xúc với các module thực hiện phân tích, tính toán và tính toán phân tán, nhưng quy mô của hệ thống lớn gấp 100 lần những gì tôi biết. Ở đây, tôi làm việc chặt chẽ với nhóm phân tích, chuyển đổi yêu cầu kinh doanh thành kiến ​​trúc phần mềm và mã chương trình, và cung cấp hỗ trợ định kỳ cho người dùng kinh doanh. Trong thời gian này, tôi đã cải thiện đáng kể quy trình tích hợp liên tục dựa trên máy chủ TeamCity và tự động hóa Python."
      },
      "Programming languages, products and technologies": "C ++, Boost, MS Excel / VBA, Python, XML / XSL / XPath, CppUnit, Oracle 11g, TeamCity, REST API"
    },
    "Numerix": {
      "Name": "Numerix, LLC",
      "Brief": "Nhà cung cấp phân tích cho các sản phẩm tài chính và chứng khoán",
      "Website": "https://numerix.com/",
      "Period": "07.2011 - 08.2012",
      "Position": "Cố vấn, Nhà phát triển phần mềm cấp cao",
      "Description": "",
      "Projects": {
        "CrossAsset": "Dự án chính của tôi là Numerix CrossAsset, một nền tảng linh hoạt để xây dựng cấu trúc, định giá và quản lý rủi ro cho các sản phẩm tài chính, có thể truy cập thông qua các add-in Excel, C++, C # hoặc Java API. Tôi đã làm rất nhiều việc tự động hóa kiểm thử chất lượng cho tất cả các loại hình, giới thiệu viết các bài kiểm tra hộp đen bằng Python cho đội của mình, vì số liệu rất có thể kiểm tra, bao gồm tỷ lệ phân tích hiệu suất trong phạm vi kiểm tra.",
        "Database": "Ngoài ra, tôi đã tăng tốc độ cơ sở dữ liệu nội bộ khoảng 4 lần bằng cách sử dụng tối ưu hóa phụ thuộc hệ thống sử dụng các API Windows và POSIX, thay vì triển khai C++ chung."
      },
      "Programming languages, products and technologies": "С/C++, Python, Excel COM API, WinAPI, POSIX API, Valgrind"
    },
    "Wärtsilä": {
      "Name": "Wärtsilä (trước đây là Transas), Corp.",
      "Brief": "Nhà phát triển và nhà cung cấp thiết bị tàu thủy và hàng không hàng đầu thế giới",
      "Website": "https://www.wartsila.com/",
      "Period": "01.2010 - 07.2011",
      "Position": "Nhà phát triển phần mềm",
      "Description": "",
      "Projects": {
        "Gravity": "Tôi đã thiết kế và phát triển phần mềm trên trang thiết bị cắm trên đất liền và trên tàu bay không người lái để giám sát cháy rừng, GUI và GIS bằng Java và phần mềm điều khiển trên đất liền và trên tàu bay không người lái bằng C / C ++. Vai trò của tôi bao gồm các nhiệm vụ phát triển quy mô đầy đủ - thiết kế ứng dụng, sửa lỗi, viết kiểm tra đơn vị và thực hiện đánh giá mã nguồn.",
        "Automation": "Một số dự án nội bộ. Ở đây, tôi đã phát triển mô-đun ghi sự kiện X-Window cho một hệ thống an ninh và giám sát phức tạp sử dụng API Xlib, và cải thiện đường ống tích hợp liên tục."
      },
      "Programming languages, products and technologies": "С/C++, Java SE, Python, Autotools, CMake, XML/XSL/XPath, Google Test"
    },
    "DoctorWeb": {
      "Name": "DoctorWeb, LLC",
      "Brief": "Nhà cung cấp giải pháp chống phần mềm độc hại và bảo mật",
      "Website": "",
      "Period": "07.2006 - 07.2009",
      "Position": "Kỹ sư phần mềm tập sự",
      "Description": "Đây là nơi bắt đầu sự nghiệp Kỹ sư phần mềm của tôi. Tôi muốn đụng đến nhiều thứ càng tốt, nhưng tôi cũng muốn tham gia vào toàn bộ chu trình từ phân tích thiết kế đến phát hành sản phẩm. Một loại thành công nào đó trong việc đó.",
      "Projects": {
        "Doctor Web Security Space": "Dự án đầu tiên của tôi là giải pháp đa mô-đun để bảo vệ máy trạm và máy chủ nhỏ khỏi phần mềm độc hại. Ban đầu tôi làm việc trên GUI, sau đó chuyển sang các thành phần khác, như thư viện SQLite C++, máy chủ RPC bất đồng bộ cho Windows, cũng như một số công việc thường xuyên như bảo trì mã nguồn cũ, sửa một số lỗi và tái cấu trúc mã nguồn.",
        "Doctor Web Updater": "Đó là một module đa nền tảng, được giả định để cập nhật bất kỳ sản phẩm của công ty nào, từ phần mềm diệt virus Windows đến các giải pháp quy mô máy chủ cho ISP. Tại đây, tôi đã triển khai một dịch vụ cập nhật đa nền tảng sử dụng các thư viện C++ và Boost thông thường, và một module Lua nhúng cho logic kinh doanh."
      },
      "Programming languages, products and technologies": "C/C++, Lua, MFC, WTL, Watcom"
    }
  },
  "Education": [
    {
      "Institution": "Đại học Kỹ thuật Thành phố Sankt-Peterburg",
      "Faculty": "Khoa Quản lý và Công nghệ thông tin",
      "Graduation": 2010,
      "Degree": "Cử nhân Kỹ thuật phần mềm",
      "Achievements": "Điểm trung bình cao nhất trong nhóm, có kinh nghiệm tham gia hội nghị và xuất bản sinh viên"
    }
  ]
}