{
  "Personal Information": {
    "Name": "Юрій Черкасов",
    "Birthdate": "21.05.1982",
    "E-mail": "yurii.cherkasov@protonmail.com",
    "Phone": [
      "+1 (256) 8503463",
      "+84 (83) 9052141",
      "+380 (68) 5655707"
    ],
    "Current location": "Ho Chi Minh City, Vietnam (UTC+7)"
  },
  "Social": {
    "LinkedIn": "https://www.linkedin.com/in/yuchdev/",
    "GitHub": "https://github.com/yuchdev",
    "Facebook": "https://www.facebook.com/yuchdev",
    "Twitter": "https://twitter.com/yuchdev",
    "Instagram": "https://www.instagram.com/yuchdev"
  },
  "Overview": "Я відданий інженер-програміст, який має понад десятирічний досвід у проектуванні та розробці програмного забезпечення з пасією створювати якісні програми та продукти. Моїм найбільшим досвідом є C++, а також Java/Python як додаткові мови програмування, окремо або разом. Я підтримував застарілі системи, реалізовував нові системи та проектував їх з нуля. Я маю досвід як в корпораціях, так і в стартапах, налагоджував процеси та робочі процедури розробки, Agile/Scrum, код-рев'ю, Continuous Integration та відстеження задач, а також забезпечував технічне керівництво невеликою командою інженерів програмного забезпечення, DevOps та QA. Ви можете переглянути мої проекти на Github, включаючи, але не обмежуючись наступними програмними проектами",
  "Projects": {
    "Advanced C++ by Example": "Я створюю навчальний матеріал для курсу 'Advanced C++'",
    "Comprehensive C++ Books Catalog": "Я є творцем та підтримувачем найбільш комплексного каталогу книг з C++",
    "Probabilistic Calculator": "Імовірнісний калькулятор, що перевіряє, чи зашифрований файл з іншими бінарними даними",
    "MD5 Bruteforcer": "Простий багатопотоковий програма для зламування пароля MD5 для хешу MD5 (лише з навчальною метою!)",
    "Code Generator": "Генератор програмного коду та звітів, який підтримує C++, Java, HTML5 та Markdown. Цей резюме було створено за допомогою цього самого генератора"
  },
  "Professional skills": {
    "Міцний досвід роботи з С/C++ (включаючи C++14/17, STL, шаблони)": [
      "Boost (бібліотеки загального призначення, мережеве програмування, метапрограмування)",
      "Qt5, QtLinguist, Qt Installer Framework",
      "Розробка для кросплатформних середовищ, яку вважаю своїм цінним активом",
      "Concurrency, lock-based and lock-free techniques, IPC, distributed computing",
      "Навчальний контент"
    ],
    "Невеликий, але досвідчений рівень роботи з Python": [
      "Django REST Framework",
      "PyQt5, PyQML, розробка додатків для робочого столу на Python",
      "Автоматизація CI/CD pipeline",
      "В цілому, я можу автоматизувати практично все з Python, і люблю це робити"
    ],
    "Досвідчений рівень роботи з Java": [
      "Core Java та JavaFX для розробки кросплатформних додатків для робочого столу",
      "High-load blackbox testing platform for REST API"
    ],
    "Розробка для Unix": [
      "Традиційні Unix Toolchains: Scripting (bash), Building (gcc, Makefiles), Debugging (gdb)",
      "Сучасні Unix Toolchains: Profiling (perf, Valgrind), Containerization (Docker), Virtualization (KVM, Xen)",
      "POSIX, pthreads, високопродуктивні техніки, такі як CPU affinity або kernel bypassing",
      "Досвід розробки для Linux, сімейства BSD та пропрієтарних Unix систем"
    ],
    "Розробка для Windows": [
      "Windows API, multithreading, services, COM and RPC",
      "Розробка на низькому рівні, система обмежень експлойту, хуки системи",
      "Використання WinDbg та аналіз дампів падінь"
    ],
    "Розробка баз даних": [
      "Використання запитів SQL, збережених процедур, тригерів, видів та індексів",
      "Досвід роботи з великими реляційними базами даних: MS SQL, Oracle 11g, Postgres",
      "Використання NoSQL (MongoDB, Redis) в різних проектах, від проектування до оптимізації",
      "Регулярне використання вбудованих баз даних: SQLite, UnQLite"
    ],
    "Навички DevOps": [
      "Постійна інтеграція та доставка: TeamCity, GitLab CI, GitHub Actions",
      "Git(Hub): керування версіями, керування гілками та випусками",
      "Docker, Ansible та загальна автоматизація робочого процесу на Linux",
      "AWS, інструменти розгортання та управління, AWS CLI та Boto3 API",
      "Технології MS Server-Side: Active Directory та LDAP, Hyper-V Server, Docker для Windows"
    ],
    "Загальні навички": [
      "Загальні інструменти керування версіями, відстеження проблем та документації: Git, Jira, Confluence, Doxygen",
      "Сучасний об'єктно-орієнтований аналіз та проектування",
      "Бібліотеки XML/XSL/XSD та запити XPath"
    ]
  },
  "Employment history": {
    "VEKTOR T13 Technologies": {
      "Name": "Vektor T13 Technologies, LLC",
      "Brief": "IT-стартап з безпеки ІТ",
      "Website": "https://www.vektort13.pro/",
      "Period": "12.2019 - 04.2022",
      "Position": "Lead C++ developer",
      "Description": "Ми були малим стартапом, що намагався створити лінію продуктів, пов'язаних з приватністю, включаючи захист від відбитків пальців, спостереження та відстеження, і мали плани створення жорсткого VPN-сервісу.",
      "Projects": {
        "Virtualbox": "Потужний віртуалізаційний продукт на основі x86/AMD64/Intel64 з відкритим кодом. Я створив свою власну гілку з невеликими вдосконаленнями над версією Oracle, реалізував крос-платформний набір інструментів збірки та працював над документацією.",
        "IP Audit": "Антишахрайська система для комплексної перевірки IP-адрес, що надає звіти про географічне розташування, деталі з'єднання та загрози, які можуть мати цей IP-адрес. Я працював на серверній стороні, розробляючи API-агрегатор проти шахрайства для збору інформації про запитані IP з різних API сторонніх розробників."
      },
      "Programming languages, products and technologies": "C, C++, Qt5, Python, PyQt, Django REST Framework, CMake, TeamCity"
    },
    "Massive": {
      "Name": "Massive, LLC",
      "Brief": "Постачальник розподіленої обчислювальної послуги",
      "Website": "https://www.joinmassive.com/",
      "Period": "09.2019 - 12.2019",
      "Position": "Senior Software Engineer",
      "Description": "Працюючи над крос-платформовим Windows/macOS SDK для альтернативної платформи монетизації додатків, яка дає розробникам більше можливостей заробляти на їх безкоштовних додатках, ніж лише додавання дратівливої реклами.",
      "Projects": {
        "Continuous Integration": "Тут я значно покращив процес розробки та пайплайн Continuous Integration, створивши єдину систему для збирання, підпису та упаковування додатка.",
        "CPU Workload": "Розробив і впровадив систему обмеження навантаження на процесор, щоб забезпечити зручний досвід користувача."
      },
      "Programming languages, products and technologies": "C++, Python, JavaScript, CMake, AWS API, Google Test"
    },
    "Web Gears": {
      "Name": "WebGear Services, LTD (Trademark CyberYozh)",
      "Brief": "Інтернет-стартап з приватності",
      "Website": "https://cyberyozh.com/",
      "Period": "10.2014 - 07.2018",
      "Position": "Consultant, Lead C++ developer",
      "Description": "З цього моменту я перейшов з великих корпорацій до малих стартапів. З моєї підприємницької досвіду я визначив практично все, від архітектури до процесів з нуля, включаючи безперервну інтеграцію та QA, але це все ж було переважно технічне, а не керівне положення.",
      "Projects": {
        "VPN-клієнт": "VPN-клієнт із захистом від витоку трафіку",
        "PanicButton": "PanicButton - система аварійного видалення даних, яка знищує всю конфіденційну інформацію без можливості відновлення у випадку критичної ситуації, наприклад, крадіжки ноутбука з чутливою інформацією"
      },
      "Programming languages, products and technologies": "C++, Boost, Qt5, Python, Windows RAS API, REST API, CMake, TeamCity"
    },
    "Deutsche Bank": {
      "Name": "Deutsche Bank AG",
      "Brief": "Глобальний інвестиційний банк",
      "Website": "https://db.com/",
      "Period": "11.2012 - 09.2014",
      "Position": "Software Engineer",
      "Description": "",
      "Projects": {
        "RAPID": "Ймовірно, найбільш технічно викликовий проект у моїй корпоративній кар'єрі до цього моменту. Це була платформа низької латентності для торгівлі, і я покращив продуктивність системи передачі повідомлень, які мають критичну латентність (<20 мкс для циклу торгівлі). Нарешті, я використав безблокуючі алгоритми не як вправу для мозку програміста, а в продуктовому коді.",
        "RMS": "Значна система управління ризиками з багаторівневою архітектурою, в якій я працював з модулями аналітики, обчислень та розподіленого обчислення, але масштаб системи був в 100 разів більший, ніж я знав. Тут я був близький до команди аналітики, перетворюючи бізнес-вимоги на програмну архітектуру та код програми, і забезпечував випадкову підтримку користувачів бізнесу. Протягом цього часу я значно покращив процес безперервної інтеграції, що базується на сервері TeamCity та автоматизації Python."
      },
      "Programming languages, products and technologies": "C++, Boost, MS Excel/VBA, Python, XML/XSL/XPath, CppUnit, Oracle 11g, TeamCity, REST API"
    },
    "Numerix": {
      "Name": "Numerix, LLC",
      "Brief": "Постачальник аналітики для деривативів та фінансових продуктів",
      "Website": "https://numerix.com/",
      "Period": "07.2011 - 08.2012",
      "Position": "Старший розробник програмного забезпечення",
      "Description": "",
      "Projects": {
        "CrossAsset": "Моїм основним проектом був Numerix CrossAsset, гнучка платформа для структуризації, ціноутворення та управління ризиками деривативів, доступна через додатки Excel, C++, C# або Java API. Я робив багато автоматизації тестування, включаючи написання чорних скриньок на Python для мого колективу, оскільки числа є дуже тестовими, а також включав профілювання продуктивності в охоплення тестів.",
        "Database": "Також я збільшив швидкість внутрішньої бази даних приблизно в 4 рази, використовуючи системно-залежні оптимізації з використанням Windows і POSIX API, замість загальної реалізації на C++."
      },
      "Programming languages, products and technologies": "С/C++, Python, Excel COM API, WinAPI, POSIX API, Valgrind"
    },
    "Wärtsilä": {
      "Name": "Wärtsilä (раніше Transas), Corp.",
      "Brief": "Світовий лідер у розробці та поставках обладнання для морського та авіаційного транспорту",
      "Website": "https://www.wartsila.com/",
      "Period": "01.2010 - 07.2011",
      "Position": "Розробник програмного забезпечення",
      "Description": "",
      "Projects": {
        "Gravity": "Я розробляв програмне забезпечення для земного обладнання та бортового обладнання для дронів, які використовувались для моніторингу лісових пожеж. Я розробив графічний і геоінформаційний інтерфейс користувача на мові Java, а також програмне забезпечення для керування земним обладнанням та бортовим обладнанням на мові C / C++. Мої обов'язки включали повномасштабну розробку програмного забезпечення - проектування програми, виправлення помилок, написання модульних тестів та проведення рецензій коду.",
        "Automation": "Декілька внутрішніх проектів. Тут я розробив модуль реєстрації подій X-Window для комплексної системи безпеки та моніторингу з використанням API Xlib, а також поліпшив безперервну інтеграцію."
      },
      "Programming languages, products and technologies": "С/C++, Java SE, Python, Autotools, CMake, XML/XSL/XPath, Google Test"
    },
    "DoctorWeb": {
      "Name": "DoctorWeb, LLC",
      "Brief": "Постачальник антивірусних та безпекових рішень",
      "Website": "",
      "Period": "07.2006 - 07.2009",
      "Position": "Молодший інженер-програміст",
      "Description": "Тут починалась моя кар'єра програміста. Я хотів працювати з якомога більшою кількістю технологій та брати участь у циклі розробки, починаючи від аналізу дизайну і закінчуючи релізом. Чимало вдалося досягнути.",
      "Projects": {
        "Doctor Web Security Space": "Мій перший проект - багатомодульний захист робочих станцій та малих серверів від шкідливих програм. Спочатку я працював з графічним інтерфейсом, а потім перейшов до інших компонентів, таких як бібліотека C++ SQLite, асинхронний RPC-сервер для Windows, а також рутинна робота з підтримкою старого коду, виправленням деяких помилок та рефакторингом.",
        "Doctor Web Updater": "Це був кросплатформовий модуль, призначений для оновлення будь-якого продукту компанії, від антивіруса для Windows до масштабних серверних рішень для провайдерів Інтернету. Тут я реалізував кросплатформовий сервіс оновлення, використовуючи простий C++ та бібліотеки Boost, а також вбудований модуль Lua для бізнес-логіки."
      },
      "Programming languages, products and technologies": "C/C++, Lua, MFC, WTL, Watcom"
    }
  },
  "Education": [
    {
      "Institution": "Політехнічний університет Санкт-Петербурга",
      "Faculty": "Факультет управління та інформаційних технологій",
      "Graduation": 2010,
      "Degree": "Бакалавр програмної інженерії",
      "Achievements": "Найвищий середній бал в групі, досвід участі в студентських конференціях та публікацій"
    }
  ]
}